<?php
namespace R\App\Enum;

/**
 * @enum
 */
class UserEnum extends Enum_App
{
    protected static $values_pref = array(
        "1" => "北海道",
        "2" => "青森県",
        "3" => "秋田県",
        "4" => "岩手県",
        "5" => "山形県",
        "6" => "宮城県",
        "7" => "福島県",
        "8" => "山梨県",
        "9" => "長野県",
        "10" => "新潟県",
        "11" => "富山県",
        "12" => "石川県",
        "13" => "福井県",
        "14" => "茨城県",
        "15" => "栃木県",
        "16" => "群馬県",
        "17" => "埼玉県",
        "18" => "千葉県",
        "19" => "東京都",
        "20" => "神奈川県",
        "21" => "愛知県",
        "22" => "静岡県",
        "23" => "岐阜県",
        "24" => "三重県",
        "25" => "大阪府",
        "26" => "兵庫県",
        "27" => "京都府",
        "28" => "滋賀県",
        "29" => "奈良県",
        "30" => "和歌山県",
        "31" => "岡山県",
        "32" => "広島県",
        "33" => "鳥取県",
        "34" => "島根県",
        "35" => "山口県",
        "36" => "徳島県",
        "37" => "香川県",
        "38" => "愛媛県",
        "39" => "高知県",
        "40" => "福岡県",
        "41" => "佐賀県",
        "42" => "長崎県",
        "43" => "熊本県",
        "44" => "大分県",
        "45" => "宮崎県",
        "46" => "鹿児島県",
        "47" => "沖縄県",
    );
    protected static $values_deliv_flg = array(
        "0" => "情報メールの配信を希望しない",
        "1" => "情報メールの配信を希望する",
    );
    protected static $values_accept_flg = array(
        "1" => "承認待ち",
        "2" => "承認",
        "3" => "削除",
    );
    protected static $values_download_flg = array(
        "1" => "未",
        "2" => "済",
    );
    protected static $values_erase_flg = array(
        "1" => "未",
        "2" => "済",
    );
}
